
## Plan Result (prod)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.ccd_importer_password_sptribs
  * azurerm_key_vault_secret.ccd_importer_username_sptribs


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.ccd_importer_password_sptribs will be created
  + resource "azurerm_key_vault_secret" "ccd_importer_password_sptribs" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sptribs-prod/providers/Microsoft.KeyVault/vaults/sptribs-prod"
      + name                    = "ccd-importer-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.ccd_importer_username_sptribs will be created
  + resource "azurerm_key_vault_secret" "ccd_importer_username_sptribs" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/sptribs-prod/providers/Microsoft.KeyVault/vaults/sptribs-prod"
      + name                    = "ccd-importer-username"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":43,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->